; domain
(define (domain rts_game)
    (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality)
	(:constants 
		level0 - level_type
		level1 - level_type
		boggy - soil_type
		sand - soil_type
		rock - soil_type
	)
    (:types 
    	
        entity entity_type soil_type loc - object
    	building unit level_type - entity
    	building_type unit_type - entity_type
    )

    (:predicates  
    	(occupied ?u - unit)
    	(trained_2 ?u - unit)
    	(trained_1 ?u - unit)
		(b_level ?b - building ?l - level_type)
    	(builder ?u - unit_type)
        (produces ?u - unit_type ?b - building_type ?l - level_type)
        (utype ?u - unit ?u2 - unit_type)
        (btype ?b - building ?b2 - building_type)
        (upgrades ?b - building_type ?b2 - building_type)
        (upgradable ?b - building_type ?l - level_type)
        (soil ?t - soil_type ?x - loc)
        (at ?u - entity ?x - loc)
        (power ?b - building)
        (need_power ?b - building)
        (used_power ?b - building)
    )

    (:action train_unit
	     :parameters (?u - unit ?ut - unit_type ?b - building ?bt - building_type ?l - level_type ?x - loc)
	     :precondition (and
	     	; Unit not trained
	         (not (trained_2 ?u))
	         (at ?b ?x)

	         
	        ;  building is of sufficient level to train
	         (btype ?b ?bt)
	         (utype ?u ?ut)
	         (b_level ?b ?l)
	         (produces ?ut ?bt ?l)
	         
	     )
	     :effect (and 
	     	; Worker is trained
            (trained_2 ?u)
            (at ?u ?x)
         )
    )
    
     (:action move
	     :parameters (?u - unit ?x - loc ?x2 - loc)
	     :precondition (and
	     	; Unit not trained
	     	(at ?u ?x2)
	         (not (at ?u ?x))
	         (not (soil boggy ?x2))
	     )
	     
	     :effect (and 
	     	; Worker is trained
            (at ?u ?x)
	        (not (at ?u ?x2))
            
         )
    )

    (:action build_building
    	:parameters(?u - unit ?ut - unit_type ?b - building ?x - loc)
    	:precondition (and
    		; worker is available
    		(utype ?u ?ut)
    		(builder ?ut)
    		(not (occupied ?u))
    		
    		(not (need_power ?b))
    		
    		(forall (?b2 - building)
				(or 
					(= ?b2 ?b) 
					(not (at ?b2 ?x)) 
				)
    		)
    		
    		; building is not built
    		(b_level ?b level0)
    		
    		(or 
    			(trained_2 ?u)
    			(trained_1 ?u)
			)
    		
    		(at ?u ?x)
    		(soil rock ?x)

    	)
    	:effect (and
    		; build building
    		(not (b_level ?b level0))
    		(b_level ?b level1)
    		
    		; worker is occupied
    		(occupied ?u)
    		
    		(when (trained_2 ?u) (and (not (trained_2 ?u)) (trained_1 ?u)))
    		(when (trained_1 ?u) (and (not (trained_1 ?u))))

    		(at ?b ?x)
    	)
    )
    
    (:action build_building_w_power
    	:parameters(?u - unit ?ut - unit_type ?b - building ?b2 - building ?x - loc)
    	:precondition (and
    		; worker is available
    		(utype ?u ?ut)
    		(builder ?ut)
    		(not (occupied ?u))
    		
    		(need_power ?b)
    		(power ?b2)
    		(not (used_power ?b2))
    		
    		
    		; building is not built
    		(b_level ?b level0)
    		
    		(or 
    			(trained_2 ?u)
    			(trained_1 ?u)
			)
    		
    		(at ?u ?x)
    		(soil rock ?x)

    	)
    	:effect (and
    		; build building
    		(not (b_level ?b level0))
    		(b_level ?b level1)
    		
    		; worker is occupied
    		(occupied ?u)
    		
    		(when (trained_2 ?u) (and (not (trained_2 ?u)) (trained_1 ?u)))
    		(when (trained_1 ?u) (and (not (trained_1 ?u))))

    		(at ?b ?x)
    		
    		(used_power ?b2)
    	)
    )
    
	(:action finish_occupied
    	:parameters(?u - unit)
    	:precondition (and
    		(occupied ?u)
    	)
    	:effect (and
    		(not (occupied ?u))
    	)
    )
    
    (:action upgrade_building
    	:parameters(?b - building ?t - building ?bt - building_type ?tt - building_type ?l - level_type ?l2 - level_type)
    	:precondition (and
    		; building is levelx and not levelx + 1
    		(b_level ?b ?l)
    		(not (b_level ?b ?l2))
    		
    		; buildings are of the right type
    		(btype ?b ?bt)
    		(btype ?t ?tt)
    		
    		; building tt upgrades bt
    		(upgrades ?bt ?tt)
    		(b_level ?t level1)
    		
    		; building bt can be upgraded
    		(upgradable ?bt ?l2)

    	)
    	:effect (and
    		; next building level
    		(b_level ?b ?l2)
    	)
    )
)

; problem
(define (problem rts1_2)
    (:domain rts_game)
    (:objects
        base - building_type
        barracks - building_type
        tank_factory - building_type
        powerplant - building_type

        base1 - building
        barracks1 - building
        tank_factory1 - building
        powerplant1 - building

        worker - unit_type
        light_infantry - unit_type
        tank - unit_type

        worker1 - unit
        infantry1 - unit
        tank1 - unit

        loc1 - loc
        loc2 - loc
        loc3 - loc
        loc4 - loc
        loc5 - loc
        loc6 - loc
        loc7 - loc
        loc8 - loc
        loc9 - loc
    )
    (:init
        (soil sand loc1)
        (soil rock loc2)
        (soil rock loc3)
        (soil boggy loc4)
        (soil rock loc5)
        (soil rock loc6)
        (soil sand loc7)
        (soil rock loc8)
        (soil rock loc9)

        (utype worker1 worker)
        (utype infantry1 light_infantry)
        (utype tank1 tank)

        (btype base1 base)
        (btype barracks1 barracks)
        (btype tank_factory1 tank_factory)
        (btype powerplant1 powerplant)

        (b_level base1 level1)
        (at base1 loc2)
        (b_level barracks1 level0)
        (b_level tank_factory1 level0)
        (b_level powerplant1 level0)

        (need_power tank_factory1)
        (power powerplant1)

        (builder worker)

        (produces worker base level1)
        (produces light_infantry barracks level1)
        (produces tank tank_factory level1)

    )

    (:goal (and
        (trained_2 infantry1)
        ; (b_level tank_factory1 level1)
        (trained_2 tank1)
        (at tank1 loc4)
    ))
)

; plan
1. (train_unit worker1 worker base1 base level1 loc2)
   added: (trained_2 worker1) (at worker1 loc2)
   goals met: 0 of 3
2. (move worker1 loc3 loc2)
   deleted: (at worker1 loc2)
   added: (at worker1 loc3)
   goals met: 0 of 3
3. (build_building worker1 worker barracks1 loc3)
   deleted: (b_level barracks1 level0) (trained_2 worker1)
   added: (b_level barracks1 level1) (occupied worker1) (trained_1 worker1) (at barracks1 loc3)
   goals met: 0 of 3
4. (train_unit infantry1 light_infantry barracks1 barracks level1 loc3)
   added: (trained_2 infantry1) (at infantry1 loc3)
   goals met: 1 of 3
5. (move worker1 loc5 loc3)
   deleted: (at worker1 loc3)
   added: (at worker1 loc5)
   goals met: 1 of 3
6. (finish_occupied worker1)
   deleted: (occupied worker1)
   goals met: 1 of 3
7. (build_building worker1 worker powerplant1 loc5)
   deleted: (b_level powerplant1 level0) (trained_1 worker1)
   added: (b_level powerplant1 level1) (occupied worker1) (at powerplant1 loc5)
   goals met: 1 of 3
8. (move worker1 loc6 loc5)
   deleted: (at worker1 loc5)
   added: (at worker1 loc6)
   goals met: 1 of 3
9. (finish_occupied worker1)
   deleted: (occupied worker1)
   goals met: 1 of 3
10. (train_unit worker1 worker base1 base level1 loc2)
   added: (trained_2 worker1) (at worker1 loc2)
   goals met: 1 of 3
11. (build_building_w_power worker1 worker tank_factory1 powerplant1 loc6)
   deleted: (b_level tank_factory1 level0) (trained_2 worker1)
   added: (b_level tank_factory1 level1) (occupied worker1) (trained_1 worker1) (at tank_factory1 loc6) (used_power powerplant1)
   goals met: 1 of 3
12. (train_unit tank1 tank tank_factory1 tank_factory level1 loc6)
   added: (trained_2 tank1) (at tank1 loc6)
   goals met: 2 of 3
13. (move tank1 loc4 loc6)
   deleted: (at tank1 loc6)
   added: (at tank1 loc4)
   goals met: 3 of 3
